{
  "profiles": {
    "_id": {
      "$oid": "65f54e9d0c923340c3e11a2a"
    },
    "name": "Prachet Patel",
    "email": "prachet.edu@gmail.com",
    "homepage_heading": "HEY👋, WELCOME TO MY PORTFOLIO",
    "homepage_description": "a full-stack developer passionate about crafting seamless digital experiences. Explore my journey through code, creativity, and collaboration.",
    "aboutpage_description": "Here, you'll uncover detailed insights into my professional journey, my areas of expertise, and my current proficiencies primarily centered around programming and technology. Explore further to gain a comprehensive understanding of my skills and capabilities in the realm of software development.",
    "about": [
      "I'm a Full Stack Developer with expertise in frontend and backend technologies. Specializing in frontend development, I create captivating user interfaces using HTML5, JavaScript, CSS, Bootstrap, and Angular.js.",
      "My portfolio showcases seamless integration between frontend elegance and backend functionality. Leveraging Java, JSP, Servlets, Node.js, Express.js, and MongoDB (with Mongoose), I've built dynamic web applications delivering exceptional user experiences.",
      "Beyond coding, I'm passionate about sharing knowledge with the Dev Community. Find me on LinkedIn and Instagram for insights on web development and programming.",
      "Proficient in Git and GitHub for version control, I also have a solid grasp of Data Structures and Algorithms, particularly array operations, divide and conquer, greedy algorithms and dynamic programming.",
      "Continuously learning, I'm eager to contribute my full-stack expertise to innovative projects. Let's collaborate and create something remarkable together!"
    ],
    "skills": [
      "HTML5",
      "CSS",
      "Bootstrap",
      "JavaScript",
      "Java",
      "Java Server Pages",
      "Servlet",
      "Hibernate",
      "Python",
      "Angular.js",
      "Node.js",
      "Express.js",
      "DBMS(mySQL)",
      "MongoDB",
      "Git",
      "Github",
      "Microsoft Azure"
    ],
    "projectspage_description": "Explore a selection of personal projects I've developed. Each project is briefly outlined, providing an overview of its purpose and features, without delving into an in-depth case study.",
    "footer_description": "I seamlessly blend frontend finesse with backend prowess as a Full Stack Developer, ensuring the success of web projects from end to end. With expertise in both frontend and backend technologies, I deliver cohesive and high-performing solutions that elevate user experiences.",
    "links": [
      "https://www.linkedin.com/in/prachet-patel-6150a3264/",
      "https://www.instagram.com/prachet_patel/",
      "https://github.com/PRACHETPATEL",
      "mailto:prachet.edu@gamil.com?subject=Visited Your Portfolio, Great Website!!"
    ],
    "developer": "Prachet Patel",
    "__v": 0
  },
  "projects": {
    "1": {
      "_id": {
        "$oid": "65f56f56cd60a4449e745bb4"
      },
      "project_name": "URL SHORTENER",
      "project_type": "Personal",
      "project_description": "Explore my newly launched URL Shortener WebApp, featuring secure Authentication and Authorization, robust database management, insightful URL statistics visualization, QR code generation, and reliable deployment for enhanced user experience and efficiency.",
      "projectspage_heading": "URL Shortener: Simplify Link Management and Enhance User Experience",
      "projectspage_description": "Experience streamlined link management with our URL Shortener project. Discover My URL Shortener: Express.js backend, MongoDB storage, secure authentication, user-friendly frontend, QR code generation and URL statistics.",
      "projectspage_overview": "My URL Shortener project offers a comprehensive solution for managing and sharing URLs efficiently. Developed using Express.js, Node.js, and MongoDB, this project encompasses a dynamic backend system with robust authentication and authorization features, ensuring the security and privacy of user data.",
      "projectspage_features": [
        "Efficient Link Management: Streamline the process of shortening and organizing URLs, providing users with a convenient platform for effective link management.",
        "Secure Authentication and Authorization: Prioritize user data protection with secure authentication and authorization features, ensuring the privacy and security of user accounts.",
        "Dynamic Backend: Utilizing Express.js and Node.js, our backend system ensures optimal performance and seamless integration with MongoDB for efficient storage and retrieval of shortened URLs.",
        "User-Friendly Frontend: Crafted with HTML, CSS, and Bootstrap, our frontend offers an intuitive and engaging user experience, making link management effortless.",
        "QR Code Generation: Each shortened URL is accompanied by a QR code, allowing users quick and convenient access to links across various devices.",
        "URL Statistics Visualization: Gain insights into link performance through our URL statistics visualization feature, powered by Charts.js, empowering users with data-driven decision-making capabilities."
      ],
      "techstack": [
        "HTML5",
        "CSS3",
        "Bootstrap",
        "JavaScript",
        "qrcode.js",
        "charts.js",
        "Express.js",
        "Node.js",
        "MongoDB",
        "Azure Virtual Machine"
      ],
      "projectsource_link": "https://github.com/PRACHETPATEL/url-shortener-webapp",
      "project_link": "https://us.prachet.me",
      "developers": [
        "Prachet Patel"
      ],
      "__v": 0,
      "project_image": "project1.webp"
    },
    "2": {
      "_id": {
        "$oid": "65f57163cd60a4449e745bb6"
      },
      "project_name": "SPECIALSTORE",
      "project_type": "Personal",
      "project_description": "Introducing SpecialStore, a dynamic J2EE web app showcasing dedication to development excellence and eagerness for innovation. SpecialStore offers a seamless user experience with sleek front-end design and robust backend functionality. Deployed on Microsoft Azure, SpecialStore exemplifies adaptability and hands-on deployment.",
      "projectspage_heading": "SpecialStore: Your Destination for Exclusive Shopping Experiences",
      "projectspage_description": "Discover SpecialStore, your premier destination for online shopping experiences like no other. Explore our meticulously crafted ecommerce platform, designed to offer an intuitive and seamless shopping journey for every customer.",
      "projectspage_overview": "SpecialStore offers a comprehensive ecommerce solution tailored to deliver exceptional shopping experiences. Developed solely for learning purposes, this prototype project leverages Java, HTML5, CSS, JavaScript, Servlets, and JSP. The platform is hosted and deployed on Microsoft Azure, ensuring reliability and scalability. As the sole developer, I transformed a free HTML/CSS template into a sleek and user-friendly frontend. On the backend, I utilized MongoDB, Java, Servlets, and JSP, deployed on the robust Tomcat webserver. Protocols such as FTP, SMTP, and HTTPS are covered to ensure seamless operations.",
      "projectspage_features": [
        "User-friendly Interfaces: Crafted to ensure an intuitive and responsive shopping experience for customers.",
        "Product Management: Seamlessly manage products to keep your inventory up-to-date and relevant.",
        "Search and Filtering: Empower customers to find products quickly and efficiently through advanced search and filtering options.",
        "Secure Shopping Cart System: Safely store selected items during the shopping journey for a smooth checkout process.",
        "Seamless Checkout Process: Guiding customers through a hassle-free checkout process to complete their purchases effortlessly.",
        "Dynamic Review and Rating System: Foster a sense of community and trust among users through interactive review and rating features.",
        "Scalability: Engineered for growth to ensure a seamless user experience.",
        "Analytics: Gain insights into user behavior for continuous improvement.",
        "Security Measures: HTTPS, secure authentication, and regular audits keep transactions safe.",
        "Email Integration: Efficient communication using SMTP for transactional emails.",
        "File Transfer: Streamlined FTP integration for file management of generated invoices."
      ],
      "techstack": [
        "HTML5",
        "CSS3",
        "Bootstrap",
        "JavaScript",
        "Java",
        "Servlets",
        "Java Server Pages",
        "MongoDB",
        "Azure Virtual Machine"
      ],
      "projectsource_link": "https://github.com/PRACHETPATEL/specialstore",
      "project_link": "https://specialstore.tech",
      "developers": [
        "Prachet Patel"
      ],
      "__v": 0,
      "project_image": "project2.webp"
    }
  }
}
